{
  "irVersion": "1.0",
  "project": "aha-go",
  "repository": "https://github.com/grokify/aha-go",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.1.0",
      "date": "2026-06-07",
      "commit": "7a194e9",
      "highlights": [
        { "description": "Go SDK for Aha.io product management platform with CLI, browser automation, and diagram rendering" },
        { "description": "Strategic canvas support for Business Model, Lean, and Opportunity canvases with SVG/D2/Mermaid export" }
      ],
      "added": [
        { "description": "Core client infrastructure with configuration, options, and error handling", "commit": "42c3d1c" },
        { "description": "Entity types and API methods for products, features, ideas, releases, goals, initiatives, epics, requirements, comments, and users", "commit": "de2d4be" },
        { "description": "Strategic canvas package supporting Business Model Canvas, Lean Canvas, and Opportunity Canvas", "commit": "fdca546" },
        { "description": "Browser automation package using go-rod for operations not available via API", "commit": "26250c6" },
        { "description": "Diagram rendering package with SVG, D2, and Mermaid output formats", "commit": "9b05809" },
        { "description": "CLI with commands for products, features, ideas, releases, goals, initiatives, epics, requirements, comments, users, canvases, and templates", "commit": "6da3d2a" },
        { "description": "OpenAPI specification and ogen-generated API client", "commit": "d91c914" },
        { "description": "Usage examples demonstrating SDK capabilities", "commit": "1f3aea7" },
        { "description": "Prism-roadmap canvas provider integration", "commit": "7a194e9" }
      ],
      "fixed": [
        { "description": "Downgrade fetchup to v0.2.4 for go-rod compatibility", "commit": "a841b6a" }
      ],
      "documentation": [
        { "description": "README with installation, quick start, and usage examples", "commit": "803154a" },
        { "description": "MkDocs documentation with Material theme covering getting started, CLI reference, use cases, and package documentation", "commit": "9a93e79" }
      ],
      "tests": [
        { "description": "Unit tests for root package: config, errors, and options", "commit": "ee25cd9" }
      ],
      "build": [
        { "description": "Go module initialization", "commit": "5214007" },
        { "description": "Internal utilities package", "commit": "f9ae8f3" },
        { "description": "GoReleaser configuration and GitHub Actions workflows for CI/CD", "commit": "256b692" }
      ],
      "dependencies": [
        { "description": "Bump actions/setup-go from 5 to 6", "commit": "31ab38d" },
        { "description": "Bump goreleaser/goreleaser-action from 6 to 7", "commit": "3156c5a" },
        { "description": "Bump actions/checkout from 4 to 6", "commit": "335bb83" }
      ]
    }
  ]
}
