{
  "irVersion": "1.0",
  "project": "aha-go",
  "repository": "https://github.com/grokify/aha-go",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.5.0",
      "date": "2026-06-20",
      "commit": "e0ab2c1",
      "highlights": [
        { "description": "Product CRUD operations (create, update, list with filters)" },
        { "description": "ListFeatures GraphQL query with release info, position, and tags" },
        { "description": "Tree-structured product listing with GraphQL support" }
      ],
      "added": [
        { "description": "CreateProduct and CreateProductLine SDK methods", "commit": "844155b" },
        { "description": "UpdateProduct SDK method with functional options", "commit": "844155b" },
        { "description": "ListProducts filtering: WithUpdatedSince, WithIdeaPortals", "commit": "844155b" },
        { "description": "ListFeatures GraphQL query with release_id, release_date, position, tagList, project fields", "commit": "af59927" },
        { "description": "ListProjects GraphQL query with parentId filter for tree traversal", "commit": "af59927" },
        { "description": "UpdateFeatureRank GraphQL mutation", "commit": "af59927" },
        { "description": "CLI: aha product create command", "commit": "17e306f" },
        { "description": "CLI: aha product update command", "commit": "17e306f" },
        { "description": "CLI: aha product list --with-idea-portals and --updated-since flags", "commit": "bedcdbe" },
        { "description": "CLI: Tree-structured product list output with GraphQL backend", "commit": "bedcdbe" },
        { "description": "CLI: Enhanced product get output with workspace_type, parent_id, description", "commit": "50c36d3" }
      ],
      "fixed": [
        { "description": "Nullable date fields (start_date, due_date, end_date, release_date, external_release_date) now decode correctly when API returns null", "commit": "e0985d5", "issue": "64" },
        { "description": "Idea description field handles object format from API (body/html_body)", "commit": "e0985d5" },
        { "description": "Pin fetchup v0.2.4 for go-rod v0.116.2 compatibility", "commit": "2fc96ad" }
      ],
      "changed": [
        { "description": "OpenAPI spec: Add product create/update endpoints", "commit": "e568fcc" },
        { "description": "OpenAPI spec: Add nullable: true to date fields across schemas", "commit": "e568fcc" },
        { "description": "OpenAPI spec: Add DescriptionObject schema for Idea descriptions", "commit": "e568fcc" },
        { "description": "Regenerate ogen client from updated OpenAPI spec", "commit": "beb8821" }
      ],
      "documentation": [
        { "description": "Document go-rod dependency situation and chromedp migration plan", "commit": "e0ab2c1" },
        { "description": "Add product create/update documentation to README and docs", "commit": "ed56045" },
        { "description": "Clarify DoRaw path format (no /api/v1 prefix needed)", "commit": "7477552" },
        { "description": "Update GraphQL package documentation with ListFeatures", "commit": "a6f4527" }
      ],
      "dependencies": [
        { "description": "Bump actions/checkout from 6 to 7", "commit": "4743859" },
        { "description": "Bump github.com/ogen-go/ogen from 1.20.3 to 1.22.0", "commit": "f902982" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-06-08",
      "commit": "31229b3927d0aad24e80b33eef80a890432b9ec8",
      "highlights": [
        { "description": "GraphQL mutations for creating features and ideas" },
        { "description": "Custom field support with SetCustomFieldValues mutation" },
        { "description": "Required field validation helpers" }
      ],
      "added": [
        { "description": "CreateFeatureWithRelease mutation for creating features in a release", "commit": "c30c035" },
        { "description": "CreateFeatureWithProject mutation for creating features in a project", "commit": "c30c035" },
        { "description": "CreateFeatureWithAssignments mutation with full assignment options", "commit": "c30c035" },
        { "description": "CreateIdea mutation for creating ideas", "commit": "c30c035" },
        { "description": "SetCustomFieldValues mutation for setting custom fields on any record", "commit": "c30c035" },
        { "description": "GetFeatureRequirements helper to discover required fields for features", "commit": "504c1d5" },
        { "description": "GetProjectCustomFieldDefinitions helper to get custom field definitions", "commit": "504c1d5" },
        { "description": "ValidateRequiredFields helper to check if required fields are provided", "commit": "504c1d5" },
        { "description": "GetFeatureScreenDefinition query for required field configuration", "commit": "b3a586a" },
        { "description": "GetProjectCustomFields query for custom field definitions", "commit": "b3a586a" },
        { "description": "GetFeatureWithCustomFields query for feature with custom values", "commit": "b3a586a" },
        { "description": "Goauth credentials file support for integration tests", "commit": "c13bf26" },
        { "description": "Mutation operations for features, ideas, and record links", "commit": "9223def" }
      ],
      "changed": [
        { "description": "Move handwritten GraphQL client to graphql/example package", "commit": "86232ae" }
      ],
      "documentation": [
        { "description": "Update GraphQL section with mutations and reference client note", "commit": "28f8d7a" }
      ],
      "dependencies": [
        { "description": "Update dependencies", "commit": "31229b3" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-06-07",
      "commit": "2edfb33a78d55e8999b05a56d938de476689d6f7",
      "highlights": [
        { "description": "Type-safe GraphQL client generated by genqlient via gqlforge" }
      ],
      "added": [
        { "description": "genqlient-generated type-safe GraphQL client with 11 query operations", "commit": "e015029" },
        { "description": "NewGenqlientClient and NewGenqlientClientWithHTTP for creating genqlient-compatible clients", "commit": "e015029" },
        { "description": "GraphQL operations: GetFeature, GetPage, GetIdea, GetRelease, GetGoal, GetEpic, GetInitiative, GetRequirement, GetProject, GetAccount, SearchDocuments", "commit": "e015029" }
      ],
      "tests": [
        { "description": "Add genqlient integration test", "commit": "2edfb33" },
        { "description": "Standardize env vars to AHA_SUBDOMAIN and AHA_API_KEY", "commit": "c93e46d" }
      ],
      "documentation": [
        { "description": "Add GraphQL genqlient usage examples and v0.3.0 changelog", "commit": "d177919" }
      ],
      "dependencies": [
        { "description": "github.com/Khan/genqlient v0.8.1 for type-safe GraphQL code generation", "commit": "e015029" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-06-07",
      "commit": "bf15bbb",
      "highlights": [
        { "description": "GraphQL client for Aha.io API with typed queries for search, pages, features, and requirements" }
      ],
      "added": [
        { "description": "GraphQL client package with configurable subdomain, API key, and HTTP client", "commit": "3319d8b" },
        { "description": "GraphQL query method for executing queries with variables and typed responses", "commit": "3319d8b" },
        { "description": "Response types for searchDocuments, page, feature, and requirement queries", "commit": "3319d8b" },
        { "description": "SetEndpoint method for testing with custom GraphQL endpoints", "commit": "3319d8b" },
        { "description": "GraphQL schema definition (8937 lines) via introspection", "commit": "9b71b82" }
      ],
      "fixed": [
        { "description": "Resolve golangci-lint errors (G306, G704, G115, dupl, gofmt)", "commit": "fe075ab" },
        { "description": "Use correct API endpoint /api/v2/graphql", "commit": "072d770" }
      ],
      "documentation": [
        { "description": "Add UTF8 icons to README Features section", "commit": "7f8180e" },
        { "description": "Update README shields and title", "commit": "543afa7" },
        { "description": "Add GraphQL API to features list", "commit": "d5d0e1b" }
      ],
      "tests": [
        { "description": "Comprehensive unit tests for GraphQL client with mock HTTP server", "commit": "3319d8b" },
        { "description": "Integration test for GraphQL introspection API", "commit": "9b71b82" }
      ],
      "build": [
        { "description": "Add site/ to gitignore for MkDocs", "commit": "b389917" },
        { "description": "Add aha binary to gitignore", "commit": "17b45bf" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-06-07",
      "commit": "7de5d4d",
      "highlights": [
        { "description": "Go SDK for Aha.io product management platform with CLI, browser automation, and diagram rendering" },
        { "description": "Strategic canvas support for Business Model, Lean, and Opportunity canvases with SVG/D2/Mermaid export" }
      ],
      "added": [
        { "description": "Core client infrastructure with configuration, options, and error handling", "commit": "42c3d1c" },
        { "description": "Entity types and API methods for products, features, ideas, releases, goals, initiatives, epics, requirements, comments, and users", "commit": "de2d4be" },
        { "description": "Strategic canvas package supporting Business Model Canvas, Lean Canvas, and Opportunity Canvas", "commit": "fdca546" },
        { "description": "Browser automation package using go-rod for operations not available via API", "commit": "26250c6" },
        { "description": "Diagram rendering package with SVG, D2, and Mermaid output formats", "commit": "9b05809" },
        { "description": "CLI with commands for products, features, ideas, releases, goals, initiatives, epics, requirements, comments, users, canvases, and templates", "commit": "6da3d2a" },
        { "description": "OpenAPI specification and ogen-generated API client", "commit": "d91c914" },
        { "description": "Usage examples demonstrating SDK capabilities", "commit": "1f3aea7" },
        { "description": "Prism-roadmap canvas provider integration", "commit": "fac7d25" }
      ],
      "fixed": [
        { "description": "Downgrade fetchup to v0.2.4 for go-rod compatibility", "commit": "a841b6a" }
      ],
      "documentation": [
        { "description": "README with installation, quick start, and usage examples", "commit": "803154a" },
        { "description": "MkDocs documentation with Material theme covering getting started, CLI reference, use cases, and package documentation", "commit": "9a93e79" }
      ],
      "tests": [
        { "description": "Unit tests for root package: config, errors, and options", "commit": "ee25cd9" }
      ],
      "build": [
        { "description": "Go module initialization", "commit": "5214007" },
        { "description": "Internal utilities package", "commit": "f9ae8f3" },
        { "description": "GoReleaser configuration and GitHub Actions workflows for CI/CD", "commit": "256b692" }
      ],
      "dependencies": [
        { "description": "Bump actions/setup-go from 5 to 6", "commit": "31ab38d" },
        { "description": "Bump goreleaser/goreleaser-action from 6 to 7", "commit": "3156c5a" },
        { "description": "Bump actions/checkout from 4 to 6", "commit": "335bb83" }
      ]
    }
  ]
}
