{
  "irVersion": "1.0",
  "project": "aha-go",
  "repository": "https://github.com/grokify/aha-go",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.3.0",
      "date": "2026-06-07",
      "commit": "7169fcb",
      "highlights": [
        { "description": "Type-safe GraphQL client generated by genqlient via gqlforge" }
      ],
      "added": [
        { "description": "genqlient-generated type-safe GraphQL client with 11 query operations" },
        { "description": "NewGenqlientClient and NewGenqlientClientWithHTTP for creating genqlient-compatible clients" },
        { "description": "GraphQL operations: GetFeature, GetPage, GetIdea, GetRelease, GetGoal, GetEpic, GetInitiative, GetRequirement, GetProject, GetAccount, SearchDocuments" }
      ],
      "documentation": [
        { "description": "GraphQL API section in README with usage examples for both generated and manual clients" },
        { "description": "Instructions for regenerating GraphQL client using gqlforge" }
      ],
      "dependencies": [
        { "description": "github.com/Khan/genqlient v0.8.1 for type-safe GraphQL code generation" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-06-07",
      "commit": "bf15bbb",
      "highlights": [
        { "description": "GraphQL client for Aha.io API with typed queries for search, pages, features, and requirements" }
      ],
      "added": [
        { "description": "GraphQL client package with configurable subdomain, API key, and HTTP client", "commit": "3319d8b" },
        { "description": "GraphQL query method for executing queries with variables and typed responses", "commit": "3319d8b" },
        { "description": "Response types for searchDocuments, page, feature, and requirement queries", "commit": "3319d8b" },
        { "description": "SetEndpoint method for testing with custom GraphQL endpoints", "commit": "3319d8b" },
        { "description": "GraphQL schema definition (8937 lines) via introspection", "commit": "9b71b82" }
      ],
      "fixed": [
        { "description": "Resolve golangci-lint errors (G306, G704, G115, dupl, gofmt)", "commit": "fe075ab" },
        { "description": "Use correct API endpoint /api/v2/graphql", "commit": "072d770" }
      ],
      "documentation": [
        { "description": "Add UTF8 icons to README Features section", "commit": "7f8180e" },
        { "description": "Update README shields and title", "commit": "543afa7" },
        { "description": "Add GraphQL API to features list", "commit": "d5d0e1b" }
      ],
      "tests": [
        { "description": "Comprehensive unit tests for GraphQL client with mock HTTP server", "commit": "3319d8b" },
        { "description": "Integration test for GraphQL introspection API", "commit": "9b71b82" }
      ],
      "build": [
        { "description": "Add site/ to gitignore for MkDocs", "commit": "b389917" },
        { "description": "Add aha binary to gitignore", "commit": "17b45bf" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-06-07",
      "commit": "7de5d4d",
      "highlights": [
        { "description": "Go SDK for Aha.io product management platform with CLI, browser automation, and diagram rendering" },
        { "description": "Strategic canvas support for Business Model, Lean, and Opportunity canvases with SVG/D2/Mermaid export" }
      ],
      "added": [
        { "description": "Core client infrastructure with configuration, options, and error handling", "commit": "42c3d1c" },
        { "description": "Entity types and API methods for products, features, ideas, releases, goals, initiatives, epics, requirements, comments, and users", "commit": "de2d4be" },
        { "description": "Strategic canvas package supporting Business Model Canvas, Lean Canvas, and Opportunity Canvas", "commit": "fdca546" },
        { "description": "Browser automation package using go-rod for operations not available via API", "commit": "26250c6" },
        { "description": "Diagram rendering package with SVG, D2, and Mermaid output formats", "commit": "9b05809" },
        { "description": "CLI with commands for products, features, ideas, releases, goals, initiatives, epics, requirements, comments, users, canvases, and templates", "commit": "6da3d2a" },
        { "description": "OpenAPI specification and ogen-generated API client", "commit": "d91c914" },
        { "description": "Usage examples demonstrating SDK capabilities", "commit": "1f3aea7" },
        { "description": "Prism-roadmap canvas provider integration", "commit": "fac7d25" }
      ],
      "fixed": [
        { "description": "Downgrade fetchup to v0.2.4 for go-rod compatibility", "commit": "a841b6a" }
      ],
      "documentation": [
        { "description": "README with installation, quick start, and usage examples", "commit": "803154a" },
        { "description": "MkDocs documentation with Material theme covering getting started, CLI reference, use cases, and package documentation", "commit": "9a93e79" }
      ],
      "tests": [
        { "description": "Unit tests for root package: config, errors, and options", "commit": "ee25cd9" }
      ],
      "build": [
        { "description": "Go module initialization", "commit": "5214007" },
        { "description": "Internal utilities package", "commit": "f9ae8f3" },
        { "description": "GoReleaser configuration and GitHub Actions workflows for CI/CD", "commit": "256b692" }
      ],
      "dependencies": [
        { "description": "Bump actions/setup-go from 5 to 6", "commit": "31ab38d" },
        { "description": "Bump goreleaser/goreleaser-action from 6 to 7", "commit": "3156c5a" },
        { "description": "Bump actions/checkout from 4 to 6", "commit": "335bb83" }
      ]
    }
  ]
}
